[
  {
    "title": "Aberdeen",
    "address": "Ground Floor East Wing\nMigvie House\n23 North Silver Street\nAberdeen\nAB10 1RJ",
    "postcode": "AB10 1RJ",
    "direction": "From Aberdeen Railway and Bus Station turn left into Guild Street, turn right onto Bridge Street, turn left onto Union Street and then take the second right into South Sliver Street beside the Music Hall. This leads you into Golden Square. At the other side of the square is North Silver Street. Travel almost to the end of this street where you will find a modern building on the left hand side - which is set back from the street. This is Migvie House, which has a cobbled walled courtyard and the entrance is in the far left corner.\n\nDisabled Access is available; Ground floor with no steps.\n\nPARKING IS NOT PERMITTED DIRECTLY OUTSIDE THE BUILDING.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.1067507644178587,
        57.147271704090876
      ]
    },
    "createdAt": "2025-01-16T15:37:49.094932Z"
  },
  {
    "title": "Aberystwyth",
    "address": "Ground Floor\n33 North Parade\nAberystwyth\nSY23 2JN",
    "postcode": "SY23 2JN",
    "direction": "From the front entrance to Aberystwyth railway station cross over the main road at the pedestrian traffic lights. Go straight down Terrace Road and turn right with the traffic on to North Parade. Number 33 is a few houses along on this side of the main road with the testing centre on the ground floor.\n\nFull Disabled Access is available via a ramp at the centre which will be put into place as required.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.081878635582141,
        52.41559463301105
      ]
    },
    "createdAt": "2025-01-16T15:37:49.094975Z"
  },
  {
    "title": "Aldershot",
    "address": "Ground Floor\n1 London House\nPickford Street\nAldershot\nGU11 1TY",
    "postcode": "GU11 1TY",
    "direction": "From Aldershot rail station, proceed into Arthur St. At next junction cross over to Pickford St. Aldershot Test Centre is 15 metres on your right.\n\nFull disabled access is available. Wheelchair access from is direct from the street and via an internal fixed ramp.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.7605514915472684,
        51.248710806411275
      ]
    },
    "createdAt": "2025-01-16T15:37:49.094997Z"
  },
  {
    "title": "Aylesbury",
    "address": "Unit 2a, Ground Floor\nMidshires Business Park\nSmeaton Close\nAylesbury\nHP19 8HL",
    "postcode": "HP19 8HL",
    "direction": "From the bus stop / public car park in Fairford Leys village, turn right towards the bandstand in the village centre then right onto the pedestrian walkway in Wedgewood Street. Continue straight on to Trenchard Street, with the Honey Bee public house on the right and the Nuffield Health Centre on the left. Continue over the roundabout into Smeaton Close. Take the 2nd right into Midshires Business Park, the Test Centre is on the left next door to the Buckinghamshire NHS Centre. There is no parking available for candidates / visitors within the business park, however at the roundabout, with the Honey Bee to the left and Nuffield Health Centre to the right, go straight over the roundabout, past the Honey Bee and then turn left into the car park which is free to use. Full Disabled Access is available - a disabled parking bay is available right outside of the main door. The ground is level leading to the centre entrance. Please note, there are no waiting facilities for people accompanying candidates.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.838695550925011,
        51.82083369842719
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095016Z"
  },
  {
    "title": "Ayr",
    "address": "1st Floor\n7A Boswell Park\nAyr\nKA7 1NP",
    "postcode": "KA7 1NP",
    "direction": "The Test Centre is located near the Ayr bus station. Travel south towards the bus station on Sandgate, turn left into Boswell Park and the centre is on the left halfway along at the junction with Arthur Street.\n\nFull Disabled Access is available; wheelchair access via a lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.632056091403554,
        55.46213875460728
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095035Z"
  },
  {
    "title": "Armagh",
    "address": "Unit 55\nArmagh Business Centre Ltd\n2 Loughgall Road\nArmagh\nBT61 7NH",
    "postcode": "BT61 7NH",
    "direction": "From Armagh town centre, head north-west on Lonsdale Rd/A29 towards Loudans Mews for 0.4miles.\n\nAt the roundabout, take the 3rd exit onto Loughgall Rd/B77\n\nFollow the road for 0.3 miles, the Armagh Business Centre Car Park is located on the left opposite the Armatile building.\n\nOn entering the building, please report to reception area to be directed to Unit 55.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -6.659033364417859,
        54.35726048831232
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095053Z"
  },
  {
    "title": "Ballymena",
    "address": "Units 3 & 4 The Tower Centre\nWellington Street\nBallymena\nBT43 6AH",
    "postcode": "BT43 6AH",
    "direction": "The Test Centre is located next door to the Main Entrance to the Tower Centre and opposite The Fayre Grill Restaurant. Access to the centre is directly off Wellington Street. If coming from the bus or train station go via Galgorm Road for approximately 500 metres. Look right and you can see McDonald. Turn Right at the busy junction and walk past McDonald's.\n\nCross over the pedestrian crossing. Walk straight on for another 75 metres to another pedestrian crossing (your will see The Merchant Fish and Chips shop on the right beside the crossing). You are now in a small pedestrianized area called Pats Brae, keep walking straight ahead on to Wellington Street and the Test Centre is approximately 150 metres on the left. Just before the entrance to the Tower Centre.\n\nFull Disabled Access is available into the centre.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -6.27648573196445,
        54.86581505788056
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095072Z"
  },
  {
    "title": "Basildon",
    "address": "Southgate House\nSuite 1A - First Floor\nTown Square\nBasildon\nSS14 1BN\n",
    "postcode": "SS14 1BN",
    "direction": "Make your way to ' Town Square' ( the Town Centre ). The entrance to Southgate House is to be found next to Nationwide Building Society and opposite Boots the chemist. Pearson Professional Centre IS ON THE FIRST FLOOR.\n\n\nFull Disabled Access is available via the main lift",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        0.4584700337321197,
        51.57009472063035
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095094Z"
  },
  {
    "title": "Belfast",
    "address": "1st floor\n119 Royal Avenue\nBelfast\nBT1 1FF",
    "postcode": "BT1 1FF",
    "direction": "From Great Northern Mall Shopping Centre, Exit onto Great Victoria Street - Cross to the far side of the street and turn left - Continue Straight ahead across the 1st set of lights and Turn Right onto Wellington Place.\n\nContinue along Wellington Place until you reach the Junction with Donegall Place - Turn Left onto Donegall Place and continue  until the Junction with Castle Place. Cross over the junction onto Royal Avenue.\n\nContinue straight on Royal Avenue until you come to the junction with North Street - Cross over and continue on Royal Avenue as it veers to the right.\n\nThe Test centre is located on the left hand side of Craft NI.\n\nPress buzzer \"1\" on intercom closest to door for entry. \n\nFull disabled access is available.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.93091053558214,
        54.60276746505115
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095113Z"
  },
  {
    "title": "Berwick",
    "address": "William Elder Building\n56-58 Castlegate\nBerwick\nTD15 1JT",
    "postcode": "TD15 1JT",
    "direction": "By Car:\nFrom the North\nAt the Morrisons roundabout on the A1 continue straight over onto the A1167 towards the town centre. Follow the A1167 over the railway bridge and past the Kwik Fit Garage. We are 200 yards further on the left hand side by the war memorial.\nFrom the South\nFollow signs for Berwick and the A1167 on the bridge over the river tweed, at the roundabout take the first exit and continue straight over the next roundabout and head under the arch, continue on this road, the William Elder Building is located on the right at the War Memorial.\nBy Rail\nOn leaving the railway station walk up the concourse and turn right, bear left after only 20 yards to the main road. Cross the main road and we are just downhill of the war memorial.\nShort stay parking is available on street and long stay parking is available in the B&M Car Park which is a 5 minute walk.\n\nThe test centre is located on the ground floor of the building with full disabled access and toilet facilities.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.0080698411322064,
        55.77311693218378
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095131Z"
  },
  {
    "title": "Bridgend",
    "address": "2nd Floor, Brackla House\nBrackla Street\nBridgend\nCF31 1BZ",
    "postcode": "CF31 1BZ",
    "direction": "Leave Bridgend Sation onto Court Road, turn left onto Norton Street and then turn left onto Brackla Street . Brackla House is up the hill on the right hand side. Please note the entrance to be used is behind the blue Railings and the floor number is 2 in the lift.\n\nFull dsiabled access is available. Wheelchair users have fixed ramp outside and use of the lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.5748377782314713,
        51.50566926767299
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095147Z"
  },
  {
    "title": "Builth Wells",
    "address": "Opposite exit of Car Park\nGroe Street\nBuilth Wells\nLD2 3BL\n",
    "postcode": "LD2 3BL",
    "direction": "Centre is directly opposite the EXIT of the main car park.\n\nFull disabled access is available. Wheelchair users can access using a ramp which will be put in place as required.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.401936920523462,
        52.149759054698336
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095164Z"
  },
  {
    "title": "Cambridge",
    "address": "Second Floor, St Andrews House\n59, St.Andrews Street\nCambridge\nCB2 3BZ",
    "postcode": "CB2 3BZ",
    "direction": "If arriving by rail, please take a bus to the bus station, from the bus station, proceed along Emmanuel Street and turn right into St. Andrew's Street. St. Andrew's House is a short distance along on the right hand side, between the Post Office and Santander, with the Grand Arcade being opposite. Disabled access is unavailable until mid April 2019 due to the lift being out out of order.There is a flat entrance from the street, the lift is directly ahead. Please note, there are no waiting facilities in the test centre or the building for people accompanying candidates.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        0.12289949325357605,
        52.20450672731005
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095182Z"
  },
  {
    "title": "Cardiff",
    "address": "Ground Floor\n1 Caspian Point\nCaspian Way\nCardiff Bay\nCF10 4DQ",
    "postcode": "CF10 4DQ",
    "direction": "From Cardiff Bay Station - Exit onto Bute Street, Follow the path to Hemmingway Road, towards Lloyd George Avenue. Cross over, and turn right towards Millennium Centre still on Lloyd George Avenue. Follow the path and turn left onto Bute Place. (The Premier Inn will be on your left). Turn left onto Pierhead Street and then after approx 100m turn left onto Caspian Way. 1 Caspian Point is on the left. By car: A multi storey Car Park is situated on Pierhead Street(snow-shock-knee). There is no onsite parking and access is strictly via the front of the building on Caspian Way. There is no drop off points or rear access.      ",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.157949837432162,
        51.46729597520259
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095198Z"
  },
  {
    "title": "Carlisle",
    "address": "10a Lowther Street\nCarlisle\nCA3 8DA",
    "postcode": "CA3 8DA",
    "direction": "Located towards the Citadel end of Lowther Street opposite the Devonshire Street junction.\n\nDisabled Access: A portable ramp is available to overcome a few steps up into the building, thereafter there is full disabled access. If you need wheelchair access please call 0300 200 1188.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.9327748374321634,
        54.89331817182363
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095214Z"
  },
  {
    "title": "Chatham",
    "address": "14-16 High Street\nChatham\nME4 4EP\n",
    "postcode": "ME4 4EP",
    "direction": "From Rochester Station, turn left and walk along to the crossroads with traffic lights. Turn left on to Rochester High street, which will lead in to Chatham High Street. The test centre is on your right.\n\nFrom Chatham Station, turn right down Railway Street, walking under the bridge. Turn left on to Chatham High Street and continue on this road. The test centre is on your left.\n\nWhen travelling via car you will need to be aware that your SAT-NAV will direct you to the old high street. You should enter Gundulph road for the correct high street. The centre is located within 50yards of this junction\n\n\nFull Disabled Access is available; wheelchair access via a ramp.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        0.5178289067464239,
        51.38321371935678
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095230Z"
  },
  {
    "title": "Chelmsford",
    "address": "Pearson Professional Centre\n1st Floor Grosvenor House\n51 New London Rd\nChelmsford\nCM2 0ND\n",
    "postcode": "CM2 0ND",
    "direction": "From the High Chelmer Shopping Centre, turn right along Tindal Street and right again down New London Road. Grosvenor House is on the left over the river. Please note that the lift is currently out of action until July 30th due to urgent repairs\n\nPlease note: If you need wheelchair access please call 0300 200 1188 for further information.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        0.47259129325357613,
        51.731670766492435
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095255Z"
  },
  {
    "title": "Clydebank",
    "address": "1st floor\nErskine House\nNorth Avenue\nClydebank\nG81 2DR",
    "postcode": "G81 2DR",
    "direction": "Erskine House is directly across the Clyde Shopping Centre on Kilbowe Road. It is situated on the right hand side entry into the Clydebank Business Park off Kilbowie Road. Singer railway station is approx 200 metres from the premises.\n\nFull disabled access is available. Wheelchair access is via a ramp and lifts are available for access to the first floor.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.405477449074988,
        55.90559538290875
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095276Z"
  },
  {
    "title": "Colchester",
    "address": "Wellington House\nButt Road\nColchester\nCO3 3DA\n",
    "postcode": "CO3 3DA\n",
    "direction": "Butt Road pay & display car park is location 200yards from Wellington house. From the car park walk down Butt Road and Wellington House is on the right hand-side.\n\nBuses are located on Headgate road - From Headgate Road you walk towards the underpass and walk pass Essex Police head quarters, continue on Butt Road for 300yards and Wellington House is located on the left hand side. Once in Wellington House the test centre is located on the 4th floor.\n\n***NO PARKING ON SITE. ALL UNAUTHORISED VEHICLE REGISTRATIONS WILL BE CAPTURED VIA AS A AUTOMATIC NUMBER PLATE READER AND FINED VIA A PRIVATE PARKING COMPANY*** The local team do not have any control over this so raise any concerns with the parking company.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        0.8946306625678372,
        51.885288134143856
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095294Z"
  },
  {
    "title": "Croydon",
    "address": "Second Floor\nCentral House\n27 Park Street\nCroydon\nCR0 1YD",
    "postcode": "CR0 1YD",
    "direction": "Exit East Croydon station walk directly into George Street, Walk down George Street. Turn left onto Wellesley Road. Turn immediately right into Park Street.. Park Street runs from the Nestle tower block (in Park Lane) to the High Street. The Test Centre entrance is situated some 200 yards down Park Street by the bus stop at the right of the red Santander Bank frontage (near to St.George’s Walk). Disabled Access is available via main front doors and internal lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.09777791812570467,
        51.37382854932778
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095316Z"
  },
  {
    "title": "Dumfries",
    "address": "77 - 79 Whitesands\nUnit 3\nDumfries\nDG1 2RX",
    "postcode": "DG1 2RX",
    "direction": "Dumfries Test Centre is on Whitesands (A781), which is the main Town Centre road next to the River Nith, at the junction with Assembly Street and next to the Spar Shop/Post Office.\n\nFull Disabled Access is available.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.6116211490749883,
        55.066909988794144
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095332Z"
  },
  {
    "title": "Edinburgh",
    "address": "Suite 1, 2nd floor\nCairncross House\n25 Union Street\nEdinburgh\nEH1 3LR",
    "postcode": "EH1 3LR",
    "direction": "At the large roundabout at the top of Leith Walk near the St. James centre, take the turn to go down Leith Walk. After a few yards (opposite the Playhouse Theatre) take first left down Union Street. Cairncross House is located on the right hand side near the foot of the hill.\n\nPlease be aware there are road works at the large roundabout. Delays are to be expected.\n\nUnion Street has been also been closed to cars due to further roadworks and can only be accessed by foot.\n\nIt is advisable to plan your journey in advance to ensure you arrive at the test centre in time for your test.\n\nFull Disabled Access is available; wheelchair access via a ramp at right of the main door building. Buzzer to allow access to the building however can only be accessed at the main entry door.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.1866510490749897,
        55.95872692990567
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095353Z"
  },
  {
    "title": "Elgin",
    "address": "2 Southfield Drive\n(Near Linkwood Medical Centre)\nElgin\nIV30 6GR",
    "postcode": "IV30 6GR",
    "direction": "From Aberdeen on A96. As you approach Elgin on the A96 take the 1st exit at roundabout onto Reiket Lane. Go through mini roundabout and follow road to next roundabout. Take 1st exit (past Cottar Hoose Pub) onto Thornhill Road.\n\nFrom Inverness on A96. Head into Elgin on A96. Go through 1st roundabout (by Dr Grays Hospital). At next roundabout take 3rd exit onto A941. Follow road, go through mini roundabout and at next roundabout take 3rd exit and go over bridge. Once over bridge take 1st exit at roundabout onto Linkwood Road. Follow Linkwood Road until next roundabout (Cottar Hoose) and take 2nd exit onto Thornhill Road.\n\nThe Test Centre is 300 metres on your left next to Linkwood Medical Centre.\n\nFull Disabled Access. The building is single story and has ground level access throughout.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.29457956626788,
        57.63675043192991
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095383Z"
  },
  {
    "title": "Fort William",
    "address": "Alexandra Hotel\nParade\nFort William\nPH33 6AZ",
    "postcode": "PH33 6AZ",
    "direction": "A82 from the South - At the 2nd roundabout in Fort William, take the 2nd exit towards Bedford hospital then take the slip road sign Posted Town centre and as you go round, corner Alexandra hotel is on your left.   \n\nA82 and A830 from the North:-   A830 join A82 and follow signs for  Town Centre. At the roundabout past the Belford Hospital, follow signs for Town Centre and Alexandra Hotel is on your left. \n\nFull disabled access available Within hotel. ",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.108116479760727,
        56.8188554918509
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095404Z"
  },
  {
    "title": "Gairloch",
    "address": "Gairloch Community Hall\nGairloch\nIV21 2BP",
    "postcode": "IV21 2BP",
    "direction": "As you come down the A832 towards Gairloch From North side. You will turn right on to the B8021and just past the Police Station you will turn right into the car park with Gairloch High School on your left and community hall in front of you. \n\nTesting is in Gairloch Community Hall. \n\nFull disabled access available Within premises.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.691792796953619,
        57.728937794474646
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095421Z"
  },
  {
    "title": "Galashiels",
    "address": "45 High Street\nGalashiels\nTD1 1RY",
    "postcode": "TD1 1RY",
    "direction": "Centre is located on the High Street adjacent to the Iceland store and the High Street car park.\n\nFull Disabled Access. The building is single story and has ground level access throughout.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.810653979760728,
        55.61756377467242
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095437Z"
  },
  {
    "title": "Glasgow",
    "address": "Suite 325, Pentagon Centre,\n36-38 Washington Street\nGlasgow\nG3 8AZ",
    "postcode": "G3 8AZ",
    "direction": "Exchange Street is located between Commercial Street and Castle Street on the south side of the city centre. Test Centre is located opposite Grossi's Dry Cleaners on Exchange Street.\n\nFull Disabled Access is available. Access is street level.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.269076106745059,
        55.85848612897078
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095453Z"
  },
  {
    "title": "Greenock",
    "address": "Ground Floor Victory Court\nCartsburn Maritime\nArthur Street\nGreenock\nPA15 4RT",
    "postcode": "PA15 4RT",
    "direction": "Test centre is located just off the A8 main road through Greenock. At Cartsburn Maritime roundabout (opposite the 'EE' call centre) turn left if coming from Glasgow direction and right if coming from Greenock town centre direction. Victory Court is directly ahead.. Entrance is located at rear of building.\n\nFull Disabled Access with facilities are available. Test Centre is on ground floor. No ramp required.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.744637308596446,
        55.94307003342972
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095469Z"
  },
  {
    "title": "Guildford",
    "address": "71 North Street\nGuildford\nGU1 4AW\n",
    "postcode": "GU1 4AW",
    "direction": "From the Railway Station: Turn right out of station main entrance. Bear left down the hill towards the Friary Shopping Centre, turn right and then left up North Street. Number 71 is about 120 yards up on the right, opposite HSBC Bank. There is a pink sign visible above the entrance which says \"Sally\".\n\nFrom the Bus Station: Bearing right as you leave your bus will bring you into North Street. Turn left and walk up about 100 yards. Number 71 is on the right, opposite HSBC Bank.\n\nPlease note: If you need wheelchair access please call 0300 200 1188 for further information.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.5727093509250109,
        51.236827325680956
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095486Z"
  },
  {
    "title": "Haverfordwest",
    "address": "Ground Floor\n33 Bridge Street\nHaverfordwest\nSA61 2AL",
    "postcode": "SA61 2AL",
    "direction": "From the bus station walk towards the river and across the bridge, follow the pathways through the Riverside Centre towards Bridge Street. Turn right onto Bridge street from the Market walkway. the Test Centre is on the Right next to New Look.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.969402393253575,
        51.80356676014671
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095502Z"
  },
  {
    "title": "Helmsdale",
    "address": "The Bridge Hotel\nDunrobin Street\nHighlands\nHelmsdale\nKW8 6JA",
    "postcode": "KW8 6JA",
    "direction": "When approaching Helmsdale town heading north on the A9,As you go over the bridge you will take the 2nd exit into Dunrobin Street follow the road to the bottom and Bridge Hotel is on your right opposite the car park. \n\nTesting on ground floor in the bridge hotel. \n\nFull disabled access available in Bridge Hotel.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.6538727355821417,
        58.117273068626425
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095519Z"
  },
  {
    "title": "Hereford",
    "address": "Ground Floor Penn House\n9-10 Broad Street\nHereford\nHR4 9AP",
    "postcode": "HR4 9AP",
    "direction": "Walking away from the Cathedral along Broad Street, Penn House is on the right hand side approximately two thirds of the way down the street. The entrance to the centre is directly opposite the Green Dragon Hotel. Full disabled access; there is a flat entrance from the street and a ramp into the Test Centre. Please note that there are no waiting facilities in the Test Centre for people accompanying candidates.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.7173294914035537,
        52.05587673316027
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095535Z"
  },
  {
    "title": "Horley",
    "address": "77 Victoria Road\nHorley\nHorley, Surrey\nRH6 7QH\n",
    "postcode": "RH6 7QH",
    "direction": "From Horley mainline railway station continue into Victoria Road - Head past Waitrose (on your right) and continue on Victoria Road for a further 400 yards - The test centre is located on the right. Bus stops are directly located outside the test centre and provide access to Crawley and the local towns.\n\n\nThere is no parking at the Test Centre but there are two local Car parks within a few minutes walk.\n\nShould you have any disability needs please contact our customer services team before arrival. Please note: We only allow candidates to wait in the test centre and ALL candidates MUST wears masks at all time.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.1632784527750324,
        51.17139063826967
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095551Z"
  },
  {
    "title": "Inverness",
    "address": "2nd Floor\n1-3 Church Street\nInverness\nIV1 1DY",
    "postcode": "IV1 1DY",
    "direction": "On exiting the main entrance of Inverness train station, turn left onto Academy Street and immediate right into Union Street. Follow Union street to the very end when it comes to Church Street (approx. 350yds). Turn left into Church Street. The test centre is located approx. 100yds on your right before you approach High Street.\n\nWhen you arrive at the Test centre building, please follow the instructions on the sign and use the entry keypad located next to the door to contact our staff. They will allow you access to the building. Once you have entered the premises, please proceed directly to the Test Centre on the second floor via the lift or stairs.\n\nFor disabled access please use the keypad entry system to call our staff who will assist you to enter the test centre via the lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.225811108596447,
        57.47779866665773
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095567Z"
  },
  {
    "title": "Isle of Arran",
    "address": "Auchrannie Country House &\nHotel\nBrodick\nIsle of Arran\nKA27 8BZ",
    "postcode": "KA27 8BZ",
    "direction": "Tests are conducted in the Spa Centre of The Auchrannie Country Hotel - This is located approximately 2 miles north of Brodick on the west side of the A841, the entrance is signposted.\n\nLocation Map and details of The Auchrannie Hotel and Spa can be viewed on http://www.auchrannie.co.uk/\n\nFull Disabled Access: Ramp entrance into the ground floor then internal lift to the first floor for testing.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.159550808596446,
        55.57553406978051
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095584Z"
  },
  {
    "title": "Isle of Barra",
    "address": "UHI North\nBarra Learning Centre\nCastlebay\nIsle of Barra\nHS9 5XD",
    "postcode": "HS9 5XD",
    "direction": "From Castlebay High School, turn left from the school and join the main road (A888) then turn right and travel for half a mile and the Craigard Hotel is on your left hand side.\n\nFull Disabled Access",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -7.499249237432161,
        56.95577995681069
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095603Z"
  },
  {
    "title": "Isle of Islay",
    "address": "The Gaelic Centre\nGarnatra\nBowmore\nIsle of Islay\nPA43 7LN",
    "postcode": "PA43 7LN",
    "direction": "Travel Details from The Council Offices Jamieson Street to the Gaelic Centre on the A846 ..\n\nOn Foot (0.9 miles time taken about 17 minutes) or by car (0.9 miles time taken 3 minutes)\n\nFrom The Council Offices in Jamieson Street turn right and walk towards the junction with Hawthorn Lane then turn left and walk to the end of Hawthorn Lane till it meets the junction with the A846 thereafter turn right and continue till you reach the Gaelic Centre on your left.\n\nSame route for vehicular travel.\n\nIf travelling by Bus .. travel time approx 8 minutes (schedule times disrupted by Covid) .. distance 0.9 miles\n\nWalk left on Jamieson Street towards Main Street and just at the bus stop near the Post Office get the 451 and it will drop you off outside the Gaelic Centre.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -6.268827506746424,
        55.76252446256867
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095619Z"
  },
  {
    "title": "Isle of Mull",
    "address": "Mull and Iona Community Trust\nAn Roth Community Enterprise Centre\nCraignure\nIsle of Mull\nPA65 6AY",
    "postcode": "PA65 6AY",
    "direction": "The testing site is located in the An Roth Community Enterprise Centre opposite the Craignure ferry bus stand.\n\nDetails and a location map of the An Roth Community Enterprise Centre can be located on www.mict.co.uk and clicking on ‘Contact Us’.\n\nFull Disabled Access: Ramps to entrance to building then internal lift to testing area on first floor",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.705868593397303,
        56.470219183871706
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095636Z"
  },
  {
    "title": "Isle of Tiree",
    "address": "Tiree Library\nCornaig\nIsle of Tiree\nPA77 6UR",
    "postcode": "PA77 6UR",
    "direction": "Travel by the local bus (Ring and Ride 01879 220 419) from outside the school where you would turn right and join the main road (B8068) where you would travel approx. distance of 5.3 miles where The Lodge would be on your left hand side.\n\nFrom the Ferry Terminal exit and join the main Road (B8068) and turn right where after approx. 2 miles, The Lodge would be on your right hand side.\n\nFrom the Airport you would exit and turn right and join the Main Road (B8068) where after approx. 11 minutes, The Lodge would be on your left hand side.\n\nIf travelling by foot it would be the same directions and distance from the school but it would take up to 2hrs.\n\nFull Disabled Access.\n",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -6.878989379524354,
        56.494205069054765
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095652Z"
  },
  {
    "title": "Kyle of Lochalsh",
    "address": "Village Hall\nMain Street\nKyle of Lochalsh\nIV40 8BY",
    "postcode": "IV40 8BY",
    "direction": "Coming from Sky A87 to Kyle of Lochalsh travel south-west towards to main Street past Bank of Scotland towards Kyle and Lochalsh Community Trust which is on the left. \n\nTesting will be held in the Kyle and Lochalsh Community hall. \n\nFull disabled access within premises.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.714046179760728,
        57.28488756790026
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095668Z"
  },
  {
    "title": "Londonderry",
    "address": "The Ebrington Centre\nGlendermott Road\nLondonderry\nBT47 6BG",
    "postcode": "BT47 6BG",
    "direction": "On leaving the Bus Station, exit onto Foyle Street and go right towards Guildhall Square. Continue past the Guildhall and Danske Bank into Waterloo Place. Turn right onto Strand Road. Continue on the left side of the Strand Road past the Bank of Ireland. Cross over at the first set of lights and take the next left into Patrick Street. Go to the end of Patrick Street and turn right into Queen Street. The office is second on the right with a blue door, and disabled access is available. This is approximately a 10 minute walk.\n\nFull Disabled Access: Street level into premises.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -7.307536064417859,
        54.99499383710112
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095684Z"
  },
  {
    "title": "Merthyr Tydfil",
    "address": "Ty Keir Hardie\nRiverside Court\nMerthyr Tydfil\nCF47 8LD",
    "postcode": "CF47 8LD",
    "direction": "From the Bus Station take the pedestrian overpass  and turn right onto Newmarket Walk. Then turn left at Victoria Street onto Castle Street and right onto Ave De Clichy, bear left after 175 yards and Ty Keir Hardy is in Riverside Court on the Right.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.3822953036312584,
        51.74825199803548
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095700Z"
  },
  {
    "title": "Mile End C",
    "address": "3 Quebec Wharf\n14 Thomas Road\nMile End, London\nE14 7AF",
    "postcode": "E14 7AF",
    "direction": "LIMEHOUSE C IS LOCATED ON THE 2ND FLOOR \n\nFrom Mile End London Underground - Exit the station and turn left into Burdett Road, walk 0.7 miles towards Canary Wharf and Thomas Street is located directly opposite Lidl’s and Tesco Express, 3 Quebec Wharf is directly on the right as you enter Thomas Street and sign posted with Pearson signs, Buses run from Mile End Underground and West Ferry Keys DLR and stop next to Thomas Street.\n***PLEASE NOTE THERE IS NO CAR PARKING AVAILABLE AT THIS TEST CENTRE***\n\nPlease note:  there is no lift to the 2nd floor and therefore not suitable for wheelchair access, please call 0300 200 1188 for further information.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.027798393253576067,
        51.51490594042708
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095717Z"
  },
  {
    "title": "Milton Keynes",
    "address": "Ashton House West\nGround Floor\nSilbury Boulevard\nMilton Keynes\nMK9 2AH",
    "postcode": "MK9 2AH",
    "direction": "From Milton Keynes Shopping Centre, travel down Midsummer Boulevard towards the Railway Station. Go across Saxon Gate, and then continue down and the across Witan Gate. No 249 is on the right, on the corner of Upper 4th Street. The Testing Centre is on the ground floor. Please note that the centre is for candidates only, there is no waiting area for friends and relatives.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.7637295337321197,
        52.041893083144735
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095734Z"
  },
  {
    "title": "Newport (Gwent)",
    "address": "6th Floor Clarence House (South Wales)\nClarence Place\nNewport (Gwent)\nNP19 7AA",
    "postcode": "NP19 7AA",
    "direction": "Crossing Newport Bridge towards Clarence Place, walking away from the railway station, Clarence House is the first multi storey building on the left. The multi storey car park is adjacent to the building.\n\nFull dsiabled access is available. Wheelchair users have fixed ramp outside and use of the lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.992398364561548,
        51.59103353801351
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095750Z"
  },
  {
    "title": "Northampton",
    "address": "Suite 201 Sol House\n29 St.Katherine's Street\nNorthampton\nNN1 2QZ",
    "postcode": "NN1 2QZ",
    "direction": "From the railway station, turn up Black Lion Hill into Marefair. Turn left into Horse Market, and right into St Katherine's Street. Sol House is on the right hand side, opposite Sol Central. The testing centre is in Suite 201 on the 2nd floor. Full disabled access is available, wheelchair entry and exit to the building is by ramp and the elevators are to the right as you enter the building. Due to shared occupancy of the building, only candidates are able to wait in the premises. (Three word location - upset, catch, slim)",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.9005109183892503,
        52.23736957543497
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095774Z"
  },
  {
    "title": "Oban",
    "address": "54 Corran Esplanade\nOban\nPA34 5AB",
    "postcode": "PA34 5AB",
    "direction": "The Corran Halls is located off the A85 Dunollie Road on the right hand side as you enter Oban from the Fort William route. From the train/bus station, the Halls is approx. 450 yards along the main pier. ",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.475941777910706,
        56.41917875384503
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095795Z"
  },
  {
    "title": "Omagh",
    "address": "Unit C10\nOmagh Enterprise Company Limited\nGreat Northern Road\nOmagh\nBT78 5LU",
    "postcode": "BT78 5LU",
    "direction": "From the Omagh Tamlaght Rd/Railway Terrace intersection , follow directions for Great Northern Rd/A5 (Newtonstewart direction) for 0.7 miles.\n\nTurn left onto Gortrush Industrial Estate and the Omagh Enterprise car park is located immediately to your left.\n\nOn entering the building, please report to reception area to be directed to Unit C10.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -7.324434195103599,
        54.60381463333727
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095812Z"
  },
  {
    "title": "Oxford",
    "address": "Top Floor (Buzzer 1)\n58 St Aldates\nOxford\nOX1 1ST\n",
    "postcode": "OX1 1ST",
    "direction": "From the Police Station turn left up towards Folly Bridge and the Head of the River public house. No 58 is on the right by the traffic lights approx 70 metres from the Police Station. On the door entry system, you will need to buzz number 1 in order for the test centre to give you access to the building, please DO NOT ring any other buzzers. Disabled Access is Available:- Through the main door and lobby, follow the signs for Pearson Professional Centres. The lift is in the right hand corner, next to stairs press button 3 for the third floor (Top) and follow the sign for the test centre on the right hand side.\n\nNB. There is limited parking in Oxford City Centre and if travelling by car use of one of the Park and Ride facilities is recommended. Please note: there are no waiting facilities in the Test Centre nor the building for non candidates.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.2566668374321628,
        51.7473388086014
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095828Z"
  },
  {
    "title": "Pitlochry",
    "address": "Fishers Hotel\n75 -79 Atholl Road\nPitlochry\nPH16 5BN",
    "postcode": "PH16 5BN",
    "direction": "Pitlochry is just off the main A9 road, halfway between Edinburgh and Inverness. There are two turn-offs from the A9 into Pitlochry.\n\nApproaching from the south (Perth), leave the A9 slip road onto Atholl Road and continue until you reach the centre of the town and you will see Fisher's Hotel to your left.\n\nApproaching from the north (Inverness), leave the A9 slip road onto Atholl Road and continue until you reach the centre of the town and you will see Fisher's to your right.\n\nPitlochry's main line train station is situated back to back with the rear gardens of the hotel.\n\nDisabled access is via main entrance into hotel, flat level access from the street.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.7347879183892503,
        56.70334805549013
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095844Z"
  },
  {
    "title": "Portree",
    "address": "Portree Community Centre\nCamanachd Square\nPortree\nIV51 9BW",
    "postcode": "IV51 9BW",
    "direction": "From Somerled Square walk north-east towards Wentworth Street. \n\nThen turn left to stay on Somerld Square for 0.2miles.\n\nThen turn left into Park Road.\n\nPortree Community Centre is on your left.\n\nFull disabled access available within premises.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -6.196655862567837,
        57.4146312645587
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095860Z"
  },
  {
    "title": "Reading",
    "address": "First Floor\nGreyfriars Gate\n5 - 7 Greyfriars Road\nReading\nRG1 1NU\n",
    "postcode": "RG1 1NU",
    "direction": "Turn right out of the station onto Blagrave Street which turns into Station Hill bending slightly right in the opposite direction to Malmaison. Turn left onto Greyfriars Road. The PPC is approximately 150metres on the Right.\n\n\nThe outer door is open half an hour before the first testing session of the day, once in the lobby press the entry bell for the first floor so the inner door can be released.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.9759875797607283,
        51.45745712755604
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095876Z"
  },
  {
    "title": "Slough",
    "address": "Brooklands House,\nBrookland Business Centre\nPetersfield Avenue\nSlough\nSL2 5DY",
    "postcode": "SL2 5DY",
    "direction": "Travelling by car, The Queensmere has 575 parking spaces and The Observatory has 830 parking spaces in, covered car parks, both of which can be accessed via Wellington Street (A4).\nCandidates should walk from The Queensmere towards Slough train station. They should then walk up to the B416 William Street (which becomes Stoke Road). Turn right at the traffic lights and walk down to traffic lights, on the corner of Mill Road (leading to Petersfield Avenue). Turn right at the lights and continue down Mill Road. The Test centre is on the left just after Mill Street changes to Petersfield Avenue. It is approximately 10 minutes walk from Queensmere to the Test Centre.\n***no parking available at this test centre and clamping in progress****\n\nDisabled access is available via front doors and access ramp",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.5894625951035976,
        51.51393277551096
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095892Z"
  },
  {
    "title": "Southend on Sea",
    "address": "2nd floor\nDencora Court\nTylers Avenue\nSouthend on Sea\nSS1 2BB\n",
    "postcode": "SS1 2BB",
    "direction": "From Southend Central Railway Station – Turn left after exiting into Clifftown Road, follow this road for 400 metres. Clifftown Road goes directly into Tyler’s Avenue where the building is located directly opposite Tyler’s Car Park.\nTyler’s Car Park – Pay and Display and located directly opposite Dencora Court.\nSouthend Bus station located on the north side of Tyler’s Avenue, Dencora Court is visible from the bus station.\n\nPLEASE NOTE THAT UNTIL 13TH MAY 2019 THE DISABLED ACCESS IS UNDER REPAIR\n\nDisabled access if available via access ramp which is situated at the rear entrance - Please note: If you need wheelchair access please call 0300 200 1188 for further information.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        0.7154881644178588,
        51.53737114118181
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095908Z"
  },
  {
    "title": "Southgate",
    "address": "1st Floor Crown House\n47 Chase Side\nSouthgate, London\nN14 5BP",
    "postcode": "N14 5BP",
    "direction": "Exit the station at Southgate, turn onto Chase Side, continue along Chase Side past the Police Station on your left, the test centre is above the KFC on the same side.\n\nNo Parking - Pay & Display on main road.\n\nDisabled access available via main front entrance Please call 0300 200 1188 for further information.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.1305330220892934,
        51.63315222411495
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095924Z"
  },
  {
    "title": "Southwark",
    "address": "10 Holyrood Street\nLondon\nSouthwark\nSE1 2EL",
    "postcode": "SE1 2EL",
    "direction": "From London Bridge station turn right into Tooley Street - walk down Tooley Street. At the fourth turning turn right into Shand Street, Continue down Shand Street and Holyrod Street is the second turning on the right (just before the railway bridge)\n\nWe have no space for visitors to wait in the PPC and CCTV in recording at all times\n\nDisabled access is available via a stair lift at the main entrance however should you use a wheelchair please call 0300 200 1188 for further information as access is restricted.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.08178292208929344,
        51.503296318948316
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095945Z"
  },
  {
    "title": "Staines",
    "address": "First Floor\n11/17 Kingston Road\nStaines\nStaines\nTW18 4QX",
    "postcode": "TW18 4QX",
    "direction": "From the Staines mainline train station - enter into Kingston Road and turn left, walk about 300 yards and the test centre is located above the mobility centre which is called \"Clearwell Mobility\" and opposite the Police Station. Use the front door on the right hand side, near the car park entrance. There is also a bus stop directly outside the test centre. There is parking at the rear but only use Pearson Parking spaces.\nPlease note: If you need wheelchair access please call 0300 200 1188 for further information.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.5048651222330537,
        51.43486772923466
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095968Z"
  },
  {
    "title": "Stevenage",
    "address": "Middlesex House\nMeadway Technology Park\nRutherford Close\nStevenage\nSG1 2EF\n",
    "postcode": "SG1 2EF",
    "direction": "From Stevenage Railway Station, Head south on Lytton Way A602 toward Danesgate, At the roundabout, take the 4th exit onto Six Hills Way A1070. At the roundabout, take the 3rd exit onto Gunnels Wood Rd. At the roundabout, take the 1st exit onto Gunnels Wood Rd A1072 . At the roundabout, take the 1st exit onto Clovelly Way At the roundabout, take the 1st exit onto Rutherford Cl , Meadway business park, Middlesex House is on the left as you enter the business park. The SB8 bus goes directly to the business park from Stevenage train station. Limited parking directly outside the test centre.\n\nDisabled access available via front entrance",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.21983953558214123,
        51.90776191154092
      ]
    },
    "createdAt": "2025-01-16T15:37:49.095992Z"
  },
  {
    "title": "Stirling",
    "address": "Hillside House\nSuite 1A\nLaurelhill Business Park\nStirling\nFK7 9JQ",
    "postcode": "FK7 9JQ",
    "direction": "At south end of Port Street take Kings Park Road just by the Black Boy Fountain. Go through 3 mini roundabouts, Kings Park is on your right. At next roundabout turn left into Laurelhill Business Park. Hillside house is the 2nd building on the right. NB:- NO PARKING FACILITIES AVAILABLE.\n\nFull Disabled Access is available via a ramp to ground floor test centre.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.9480448374321635,
        56.11061586397563
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096013Z"
  },
  {
    "title": "Stranraer",
    "address": "The Millennium Centre\n75 George Street\nStranraer\nDG9 7JP",
    "postcode": "DG9 7JP",
    "direction": "Enter via Church Street (one way street) to junction with George Street, turn left into George Street, test centre is in the Millennium Centre 50 metres on the left.\n\nFull Disabled Access: The testing centre is located on the first floor of the building.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.0291009220892935,
        54.90466217397187
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096029Z"
  },
  {
    "title": "Swansea",
    "address": "2nd Floor\nGrove House\n3 Grove Place\nSwansea\nSA1 5DF",
    "postcode": "SA1 5DF",
    "direction": "From the traffic lights at the junction of Orchard Street and The Kingsway head along Bellevue Way towards the police station. At the end of the road turn right and Grove House is immediately on your right.\n\nFull dsiabled access is available. Wheelchair users have fixed ramp outside and use of the lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.9448820222330365,
        51.62271996529054
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096045Z"
  },
  {
    "title": "Tarbert",
    "address": "Templer Arts and Leisure Centre\nHarbour Street\nTarbert\nPA29 6UD",
    "postcode": "PA29 6UD",
    "direction": "From the A83 junction onto Harbour Street.The testing centre is locaedapprox 175yards on the right hand side.\n\nDisabled access is via entrance on main road, flat level access from the street. A lift is available to top floor testing suite.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.412464808596446,
        55.86367653027545
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096062Z"
  },
  {
    "title": "Tunbridge Wells",
    "address": "Foundation House\nCoach and Horses Passage\nThe Pantiles\nRoyal Tunbridge Wells\nTN2 5NP\n",
    "postcode": "TN2 5NP",
    "direction": "From Tunbridge Wells’ mainline station, walk/drive along Vale Road and join the A26 (London Road). Follow the road and continue on the A26 straight over the first mini roundabout, the Pantiles will be on your left, the Common on your right.\nContinue straight over the 2nd mini roundabout, still on the A26.\nTake the NEXT turning left (Linden Park Road) and The Pantiles is immediately on your left. There is a car park a bit further on the left and free 2 hour parking up the hill.\nOn the Pantiles, between the Bandstand and the shops, walk down the steps (signed Tourist Information Centre) and look left and you will see the sign “Coach & Horses Passage”. Turn right into the Passage and walk a short distance and the Test Centre is in the first office building on your left. Please press the buzzer and state your name to gain entry.\nFrom the car park in Linden Park Road you can walk from the other direction, pass the Sussex Arms on your left into a large open courtyard, this is Sussex Mews. Turn left into Coach & Horses Passage and the Test Centre is a short distance along the right hand side.\nPearson VUE Professional Test Centre sign with DVSA and CITB logos is opposite the door to guide you.\nThe Pantiles offers a variety of cafes and restaurants for companions to use while candidates take their test. No visitors are allowed to wait in the Test Centre.\n\n\nDisabled access available via front entrance",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        0.25806492023927174,
        51.126217305745605
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096078Z"
  },
  {
    "title": "Ullapool",
    "address": "Ullapool Village Hall\n4 Market Street\nUllapool\nIV26 2XE",
    "postcode": "IV26 2XE",
    "direction": "From the Ullapool Pier on West Shore Street, follow the road the road north west to Quay Street.\n\nTurn left in Quay Street towards Market Street in 0.1miles.\n\nTurn right into Market Street.\n\nThe Village Hall is located on your right-hand side.\n\nLocation Map and details of Ullapool Village Hall can also be found on 'Google' by typing 'Ullapool Village Hall",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -5.160166722089293,
        57.89794424391374
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096094Z"
  },
  {
    "title": "Uxbridge",
    "address": "5-7 Pantile Walk\nPavillions Shopping Centre (inside)\nUxbridge\nUB8 1LP",
    "postcode": "UB8 1LP",
    "direction": "The Pavilion Shopping centre is in the centre of Uxbridge. The London Underground is directly opposite the Pavilion's, and the bus station is in Bakers Road. From Bakers Road head directly into Bakers Yard, continue for 200 yards and the Pavilion's will be directly opposite.\n\nThe Pavilion's offers pay & on foot parking - Once in the Pavilion's maps are provided, and you should head for unit 5/7 Pantile Walk\n\nPlease note that visitors are not permitted to wait in the centre",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.48173423558214135,
        51.54671068869741
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096112Z"
  },
  {
    "title": "Worthing",
    "address": "Unit 2, Chatsworth House,\n39 Chatsworth Road\nWorthing\nBN11 1LY\n",
    "postcode": "BN11 1LY",
    "direction": "From Worthing station: (approx 20 minutes walk) Follow signs for Town Centre. Turn left into Chatsworth Road (off Chapel Road). The Test Centre is on the same side of the street as the Police Station, and opposite a NCP car park.\n\nDisabled access via main entrance",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.36810748889851175,
        50.81314015716463
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096128Z"
  },
  {
    "title": "Manchester",
    "address": "Blue Zone, Ground Floor , Suites 3 & 4\nUniversal Square\nDevonshire Street North\nManchester\nM12 6JH\n",
    "postcode": "M12 6JH",
    "direction": "The test centre is located in the blue zone of the Universal Square development. The main building reception is accessed from Devonshire Street North, please report to reception and they will direct you to the test centre.\n\nArdwick Rail Station is located next to the Universal Square site and the closest bus stop is on Hyde Rd near to the junction of Devonshire Street North and adjacent to the Hyde Road Bus depot.\n\nThere is no public parking at Universal Sq, however there is on street parking on the near by roads.\n\nDisabled access via ramp to the complex main entrance, once in the main doors flat level access to our office.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.2149571813922098,
        53.47139502378352
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096144Z"
  },
  {
    "title": "Stockport",
    "address": "Ground Floor Kingsgate\nWellington Road North\nStockport\nSK4 1LW",
    "postcode": "SK4 1LW",
    "direction": "From the bus and railway stations proceed along the A6 towards Manchester. After passing Heaton Lane and Debenhams Store continue for approximately another 300 yards where you will see Kingsgate House on your right. Please note parking is not available and the reception area is on the ground floor at the far end of the building.\n\nDisabled access via ramp from building car park to main entrance, internal ramp to our office suite .",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.1657388914035547,
        53.412270769128945
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096162Z"
  },
  {
    "title": "Oldham",
    "address": "\n5A - 6A Whitney Court\nSouthlink Business Park\nHamilton Street\nOldham\nOL4 1DB\n",
    "postcode": "OL4 1DB",
    "direction": "Whitney Court is located on Southlink Business Centre, Hamilton Street, Oldham, Close to Oldham Mumps Railway Station. Turn off Glodwick Road into Hamilton Street and go past the GPO offices. Whitney Court is well sign posted. Entrance is at the rear. There is no car parking available.\n\nDisabled access via main entrance door flat and level from the roadway.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.1016076199146405,
        53.540384825137714
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096178Z"
  },
  {
    "title": "Huddersfield",
    "address": "5th Floor\nRamsden House\nNew Street\nHuddersfield\nHD1 2TW\n",
    "postcode": "HD1 2TW",
    "direction": "The Test Centre is located at the side of the Town Hall in Ramsden House access from Corporation Street and New Street, bus stops and public car parks are all close by.\n\nFOR CANDIDATES WITH SATURDAY BOOKINGS ACCESS TO THE CENTRE IS FROM NEW STREET ONLY, WHICH IS OPPOSITE RAMSHAW'S BUTCHERS NEAR PRIMARK.\n\nDisabled access via New street entrance flat level access from street into the building then internal left to the office - buzzer entry system",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.7832197355821415,
        53.64418270111852
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096198Z"
  },
  {
    "title": "Preston",
    "address": "Ground Floor Norwest Court\nGuildhall Street\nPreston\nPR1 3NU\n",
    "postcode": "\nPR1 3NU",
    "direction": "THIS CENTRE DOES HAVE WHEELCHAIR ACCESS VIA THE MAIN ENTRANCE AT GUILDHALL STREET.\nSituated at the bottom of Guildhall Street at its junction with Cross Street. Guildhall Street is off Fishergate opposite Marks and Spencer and the Y.M.C.A.\n\nDisabled access via ramp to building entrance flat and level once inside - buzzer entry system",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.6996326492187137,
        53.75664574756368
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096214Z"
  },
  {
    "title": "Stoke-on-Trent",
    "address": "Unit 8a\nWhittle Court\nTown Road Business Quarter\nHanley\nST1 2QE",
    "postcode": "ST1 2QE",
    "direction": "Situated about 20 minutes walk from the main bus station in Hanley, or bus number 18 will bring you close to the test centre. Town Road can be accessed by car from Potteries Way. Whittle Court is about 200 metres along Town Road going out of Hanley town centre towards Smallthorne. The entrance to Whittle Court is beside Bennett House (the Immigration Appellate Authority). Full Disabled Access: flat entrance to building Please note, there is no candidate or visitor parking and waiting facilities within the test centre are for candidates only",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.171342349074989,
        53.03264389376538
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096231Z"
  },
  {
    "title": "Liverpool",
    "address": "Lower Ground Floor\n5 Covent Gardens\nLiverpool\nL2 8UD\n",
    "postcode": "L2 8UD",
    "direction": "\nDirection to the Covent Garden location\nCovent Garden runs between Water St (A57) and Chapel St and if approaching from the Water St end the office is on the left hand side down the steps through the black metal gates of the building which has blue tiled columns on it fascia.\nLocal landmarks :-\nOriel Chambers are at the junction of Water St and Covent Garden\nIf arriving by train Covent Garden is opposite the rear entrance to James Street station.\n\nThe centre has a limited number of seats for candidates only. Relatives and friends cannot wait in the centre.\n\nCandidates requiring wheelchair access should the aware the entrance is via a ramped entrance on Water St. Please note: If you need wheelchair access please call 0300 200 1188 for further information.\n\nCandidate should be aware - between Jan and Jun 2019 Mersey rail are carrying out platform upgrade work which will involve station closures - more datails available on the Mersey Rail website",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.993507733732121,
        53.40704418956005
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096247Z"
  },
  {
    "title": "Sheffield",
    "address": "Orchard House 3rd floor\nLeopold Street\nSheffield\nS1 2GY\n",
    "postcode": "S1 2GY",
    "direction": "The Test Centre is situated at the junction of Leopold St and Fargate in the centre of Sheffield. The building entrance is on Leopold St, opposite the Yorkshire Building Society and the building name is on the wall directly above the entrance.\nFor additional assistance - There are automatic glass entrance doors located near to a large bus shelter.\n\nThe Town Hall is the nearest bus stop - the nearest car park is located at John Lewis dept. store\n\nDisabled access via main office door, buzzer entry system , flat level access from footpath. Lift access to 2nd floor",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.4706091374321624,
        53.38146598797395
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096264Z"
  },
  {
    "title": "Chester",
    "address": "1 Corbridge House\nThe Square\nSeller Street\nChester\nCH1 3AN\n",
    "postcode": "CH1 3AN",
    "direction": "\n\"From Chester Railway station walk down City Road keeping to the left hand pavement. Immediately after crossing the canal bridge take the steps down to the canal tow path. Go under the bridge and follow the path keeping the canal on your right. The Test Centre is about 150 yds on the left.\n\nPlease note the on street parking around the test centre is residents permit only\n\n\nFrom the entrance to the main bus terminal, cross the road in front of you at the pedestrian lights. In front and slightly to your left, you will see Mecca Bingo.\nOnce you have crossed the road, bear right on the footpath across the canal bridge, then immediately left down the steps to the lock keeper public house. Pass by the pub on the right, then bear right onto the canal towpath. Follow the towpath keeping the canal on your left, passing under a large road bridge. The Mill House hotel will be to your left, across the canal. Carry on following the towpath till you reach a smaller road bridge at the junction with Seller Street. Cross the Road here, then down the steps in front of you and the test centre will be seen immediately to your Right.\n\nDisabled access - flat level entry via main office door from the street",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.8834401988036404,
        53.19353896734756
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096280Z"
  },
  {
    "title": "Wrexham",
    "address": "Unit 7\n3, Henblas Street\nWrexham\nLL13 8AE",
    "postcode": "LL13 8AE",
    "direction": "The Test Centre is located in the centre of the pedestrianised Wrexham high street on Henblas Street close to the  Xplore! Science Discovery Centre. Disabled access is via the flat entrance.\n\nFrom the High Street walk east towards York Street, then turn left onto Chester Street and left again onto Bank Street and then take a slight right onto Henblas Street. ",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.9929023951035982,
        53.04651129556384
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096296Z"
  },
  {
    "title": "Skipton",
    "address": "Suite 3, First floor\nHigh St House (access via Newmarket St)\nHigh St\nSkipton\nBD23 2HU",
    "postcode": "BD23 2HU",
    "direction": "High St House is located at the junction of High St and Newmarket St. Access to the building is via the first doorway on the left hand side of Newmarket St if travelling from High St. As a land mark there is a shop called \"The Shop on the Corner\" at the corner of the junction next to the mini-roundabout. Please enter and exit quietly to respect our neighbours and please be aware there is no waiting in the building.\n\nThe centre is a short walk from the bus station and approx. a 10 mins walk from the railway station.\n\nDisabled access via main building entrance , flat and level from footpath , lift access to the 1st floor and a small ramp to gain access to our office door.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.016392450925011,
        53.960684517677876
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096317Z"
  },
  {
    "title": "Leeds",
    "address": "Gallery House 1st Floor\nThe Headrow\nLeeds\nLS1 5RD",
    "postcode": "LS1 5RD",
    "direction": "The centre is located on the Headrow directly opposite the Henry Moore Institute /art gallery & war memorial - the entrance door is situated next to Savers, 2 doors along from the main entrance to Gallery house.\n\nThe entrance door is controlled via an intercom please press the buzzer on arrival and wait to be let in, once inside please take the stairs to the first floor.\n\nPlease note disabled access is via the main Gallery House entrance, flat and level from footpath and via internal lift to 1st floor.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.5477348509250106,
        53.79969442398351
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096339Z"
  },
  {
    "title": "Chesterfield",
    "address": "Suite 1B, 1st Floor\n6-8 Corporation St\nChesterfield\nS41 7TP",
    "postcode": "S41 7TP",
    "direction": "The Test centre is located opposite the Pomegranate Theatre which is part of the Chesterfield museum building. Parking is available to the rear of the building in the Magistrates Court pay and display car park. There is a disabled parking bay directly opposite the Test Centre, and a dropped kerb at the top of the road. Please call Pearson Customer services (0300 200 1122) for wheelchair access to be arranged. Entry to the building is via an intercom system and at this point assistance can be requested for a member of staff to go down and assist. There is a 'platform' lift that can accommodate wheelchairs. Please note that there are no waiting facilites for anyone accompanying candidates",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.4231533067464242,
        53.236966968430565
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096355Z"
  },
  {
    "title": "Harrogate",
    "address": "30 Victoria Avenue\nHarrogate\nHG1 5PR",
    "postcode": "HG1 5PR",
    "direction": "The test centre is approximately a seven-minute walk from Harrogate railway station.\n\nOn leaving the station, turn left on to A61 Station Parade and walk about 300 metres before turning left on to Victoria Avenue. Walk through one roundabout and 30 Victoria Avenue will be seen on the right-hand side. Waitrose supermarket is approximately 200 metres away.\n\nThere is free but limited parking on the road outside the office.\n\nThe building is accessible via a ramp and our office is on the ground floor which has an accessible toilet. ",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.5338428085964455,
        53.99114335205343
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096371Z"
  },
  {
    "title": "Doncaster",
    "address": "Office 6 Silver House\nSilver Street\nDoncaster\nDN1 1HL",
    "postcode": "DN1 1HL",
    "direction": "The test centre is approx.5 minutes walk from the town centre. From the Danum Hotel on High Street cross the road at the traffic lights and walk down Silver Street for 100yards. The test centre is on the second floor at Silver House, which is an office block approx half way along Silver St. The entrance is located next door to the Gallery club.\n\nDisabled access once in the building via the main entrance access to our office is via ramp and internal lift",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.1314859355821416,
        53.52347578638775
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096388Z"
  },
  {
    "title": "Derby",
    "address": "Ground Floor East Wing\n100 Mansfield Road\nDerby\nDE1 3TT",
    "postcode": "DE1 3TT",
    "direction": "\nThe Test Centre is located on the ground floor at 100 Mansfield Road, Chester Green, Derby, it is in the East Wing of the College of Health and Beauty, a building with a large glass frontage at the roundabout facing St Pauls church. It is a 15 minute walk from the City Centre bus station via Full Street, Sowter Rd, St Mary's Bridge and Mansfield Rd. Buses for Chester Green, Oakwood (22 and 24), Breadsall and Little Eaton all pass the test centre\n\nOnce on Mansfield Road, proceed to the roundabout and then turn right into Prime Parkway (also signposted for the Police Headquarters). The Test Centre is situated within the building on the right and pedestrian access is gained through the large black gates.\nFull disabled access; Wheelchair access is available by a permanent raised walkway in to the test centre. Entrance to the Test Centre is gained through the second single door on the right. PLEASE NOTE THERE ARE NO PARKING FACILITIES AT THIS CENTRE but there is parking space available on the adjacent roads. Please also note that there are no waiting facilities in the Test Centre for people accompanying candidates",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.4722170048964023,
        52.929700811246704
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096404Z"
  },
  {
    "title": "Rhyl",
    "address": "3 Bodfor Street\nRhyl\nLL18 1AS",
    "postcode": "LL18 1AS",
    "direction": "Walking away from Rhyl railway station cross at the first traffic lights and you are on Bodfur Street. The test centre is the last retail premises on the left hand side before the next set of traffic lights.\n\nDisabled access via the main office door flat and level from footpath",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.490606993253576,
        53.31969109527162
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096420Z"
  },
  {
    "title": "Shrewsbury",
    "address": "Suite 2 Canon Court West\nAbbey Lawn\nAbbey Foregate\nShrewsbury\nSY2 5DE",
    "postcode": "SY2 5DE",
    "direction": "Travelling by train or bus: From the town centre go down WYLE COP over the ENGLISH BRIDGE. Under the railway bridge bear left behind the Abbey into HORSEFAIR. Follow signs to ABBEYLAWN where we can be found on the ground floor of CANON COURT WEST. Travelling by Car: On reaching the A5 bypass follow the bypass to EMSTREY ISLAND on the east of the town. Take the A5064 LONDON ROAD (Crematorium/Town Centre). In 0.75 mile at the roundabout take third exit leaving the Shirehall on your right. In 300 yards at traffic lights go straight on. In 100 meters turn right before the ABBEY CHURCH . In 200 yards turn left into Abbey Lawns. The test centre is situated on the ground floor of CANON COURT WEST. Full disabled access; the Test Centre is located on the ground floor and has a flate entrance. There is strictly no parking for candidates at Abbey Lawns, so anyone wishing to leave a car should park at Abbey Foregate Pay and Display",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.742754037432163,
        52.7092735039447
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096440Z"
  },
  {
    "title": "York",
    "address": "Stirling House\nStation Business Park\nHolgate Park Drive\nYork\nYO26 4GB",
    "postcode": "YO26 4GB",
    "direction": "\nThis centre is located on the Holgate Business Park on the A59 ( Poppleton Road ) out of York.\n\nPLEASE NOTE there is no public parking on site, however there is on street parking in the area.\n\nUsing public transport take the No. 1 Bus from York Rail Station to the Fox Pub then take the right hand fork and the centre is 200 metres on the right. The No 10 bus stops at Windmill Rise directly opposite the Centre.\n\n\nBy car the Centre is best approached from the A1237 Ring Road onto the A59 ( Harrogate Road ) INTO York. Continue along this road into York until you reach a set of traffic lights with the CPP Building on the left. Turn left onto Holgate Park Drive. Follow the road round and turn right into Station Business Park and the Centre is directly in front of you.\n\nFrom York take the A59 Harrogate Road. Continue along Poppleton Road until you reach the traffic lights with CPP Building on the right. Turn right into Holgate Park Drive. Follow the road round and turn right into the Station Business Park and the Centre is directly in front of you.\n\nDisabled access via main door to the unit flat and level from footpath",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.10794243373212,
        53.957227582311425
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096467Z"
  },
  {
    "title": "Nottingham",
    "address": "Chiltern House\nCastle Gate\nNottingham\nNG1 7AR",
    "postcode": "NG1 7AR",
    "direction": "From the Broadmarsh Centre, go up Lister Gate. From Lister Gate, travel along Castle Gate, away from Marks and Spencer. Chiltern House is located at 25 Castle Gate, approximately 200 metres on the left.\nThe Test Centre is located at the rear of 25 Castle Gate, through the archway and down the ramp. Use the intercom to contact the Centre staff.\nPlease do not use the Postcode on Maps to find the specific location of the Test Centre. Full Disabled Access is available; wheelchair access via lift to the Lower Ground Floor. Please note, there are no waiting facilities for people accompanying candidates.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.1505909527750322,
        52.951077438401725
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096486Z"
  },
  {
    "title": "Barrow in Furness",
    "address": "111 Duke Street\nBarrow in Furness\nLA14 1XA",
    "postcode": "LA14 1XA",
    "direction": "Located close to the junction with Abbey Road and opposite HSBC within the commerical area of Barrow.\n\nFull disabled access for the test centre is located on the main entrance.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.230762295103598,
        54.11352468101328
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096503Z"
  },
  {
    "title": "Wolverhampton",
    "address": "2nd Floor Derwent House\n42-46 Waterloo Road\nWolverhampton\nWV1 4XB",
    "postcode": "WV1 4XB",
    "direction": "On leaving the bus or railway station, walk along Lichfield Street towards the city centre and continue straight ahead into Darlington Street. Approximately half way down the hill in Darlington Street, turn RIGHT at the traffic lights into Waterloo Road. Derwent House is at the far end of Waterloo Road on your right, near to the major traffic light controlled junction with the Ring Road. Disabled access; To the right of the main entrance there is a ramp to gain access to the foyer of the building. Go through the glass doors in the foyer and the lift is located on the left hand side. When exiting the lift on the second floor, turn right, go through the double doors and follow the signs for the PPC and enter ROOM 1. There is ample on street parking in side streets and easily located multi story parking nearby. Please note that the waiting area at the test centre is CANDIDATES ONLY.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.132302835725875,
        52.58757839400332
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096519Z"
  },
  {
    "title": "Kendal",
    "address": "Office Suite 2\n50 Kentgate Place\nKendal\nLA9 6EQ",
    "postcode": "LA9 6EQ",
    "direction": "From Kendal railway station, travel south on Longpool(A6). At the roundabout, take the 2nd exit onto Station Rd/A6. Continue to follow A6 for approx 75 yards. The test centre is located at the corner of Station Rd and Beezon Road. The entrance to the building is on Beezon Road.\n\nDisabled Access: Disabled Access: A portable ramp is available to overcome a step up into the building, thereafter there is full disabled access. If you need wheelchair access please call 0300 200 1188",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.74280590213747,
        54.33142960242741
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096536Z"
  },
  {
    "title": "Birmingham",
    "address": "First Floor, 155 Great Charles Street\nQueensway\nBirmingham\nB3 3LP",
    "postcode": "B3 3LP",
    "direction": "DIRECTIONS:- The Test Centre entrance is located on the corner of Great Charles Street and Paradise Circus, next door to 'Spaces' which is next door to University College Birmingham (UCB). The building name is 154 Great Charles. The Test Centre has it's own separate entrance to the left of the main entrance.\n\nFull Disabled Access is available via our entrance.\n\nPlease note that there are no waiting facilities in the Test Centre for people accompanying candidates.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.9048548780544141,
        52.481820584375235
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096552Z"
  },
  {
    "title": "Birmingham B",
    "address": "155 Great Charles Street\nQueensway\nBirmingham\nB3 3LP",
    "postcode": "B3 3LP",
    "direction": "The Test Centre is located on the corner of Great Charles Street and Paradise Circus, next to Spaces which is next to University College (UCB). The building name is 154 Great Charles Street. The Test Centre has it's own entrance, to the left of the main entrance. Full disabled access is available. Please note there are no waiting facilities in the Test Centre for for non candidates",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.9052433644178588,
        52.48159398525028
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096568Z"
  },
  {
    "title": "Sutton Coldfield",
    "address": "Ground Floor\n31-33 Birmingham Road\nSutton Coldfield\nB72 1QE",
    "postcode": "B72 1QE",
    "direction": " Please note this site relocated from the previous address in November 2019* Sutton Coldfield Test Centre is on the A5127 between Duke Street and While road. Access to the test centre is on Birmingham Road. The Test Centre is situated on the ground level of a large brown building on the corner of Duke Street and Birmingham Road. Trains are on the cross city line, the nearest station is Sutton Coldfield train station. Buses run regularly from the town centre. Full disabled access is available; the office is situated on the ground floor with a flat approach. Please note, there is no parking for candidates at the site, and no waiting facilities for people accompanying candidates",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.8262851355821412,
        52.55876314191763
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096584Z"
  },
  {
    "title": "Dudley",
    "address": "Trafalgar House\nLower ground flr\n47-49 King Street\nDudley\nDY2 8PS",
    "postcode": "DY2 8PS",
    "direction": "By car, exit A461 Southern bypass at Flood Street Island toward the Town Centre & take the first left onto New Mill Street. Turn left at the traffic lights onto King Street, Trafalgar House is 75 metres on the left. From the Bus Station, walk west along King St (towards Stourbridge & Merry Hill) for about 500 metres, Trafalgar House is on the left. The Test Centre is on the Lower Ground Floor.\nDisabled access is to the right of the main entrance. Please enter through this door and follow the hallway round until you enter the main part of the building. Walk ahead through the double doors in a straight line, the building receptionist will be on the left hand side and the lift will be straight ahead in front.\nTake the lift to the lower ground floor. On exiting the lift, the PPC is located through the lift door and 15 ft to your left.\nPlease note that there are no waiting facilities in the Test Centre for people accompanying candidates.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.0845722932535753,
        52.50855553085185
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096600Z"
  },
  {
    "title": "Redditch",
    "address": "\nSecond Floor Grosvenor House\nProspect Hill\nRedditch\nB97 4DL",
    "postcode": "B97 4DL",
    "direction": "Leaving Redditch train station turn left and cross over Helwell Road continuing up Unicorn Hill. Once at the top of Unicorn Hill bear left at the pedestrian traffic lights. After 200 yards you will cross Church Road.\nOnce you have crossed Church Road continue for approximately another 200 yards and as you start to go downhill you will see Grosvenor House on the right hand side where the test centre is situated on the second floor.\nFull disabled access is available via doors on ground floor (No ramp required)\nDisabled parking facility is available by prior arrangement, please call Pearson Customer services (0300 200 1122) if required. There is no on site parking for candidates.\n\nPlease note that there are no waiting facilities for people accompanying candidates",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.9399994355821413,
        52.30923589042283
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096616Z"
  },
  {
    "title": "Coventry",
    "address": "2nd Floor\n9 Little Park Street\nCoventry\nCV1 2UR",
    "postcode": "CV1 2UR",
    "direction": "The Test Centre is on the second floor of a 5 storey building. The building exterior is White / Grey with 9LPS above the front door. It is on a commercial street overlooking the Magistrate's Court, a short walk from Coventry Train station. By Bus - LP1 is right outside the building and buses 11, Platinum 24, 25a, 12, 25 and 30 stop here. By Car - Off juction 5 on the ring road, entering New Union Street and right to Little Park Street. Salt Lane multi storey, CV1 2GY, is the nearest car park plus there is some metered parking on the street.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.508904693253576,
        52.40667368405158
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096632Z"
  },
  {
    "title": "Stratford upon Avon",
    "address": "Packwood House, 2nd Floor\nGuild Street\nStratford upon Avon\nCV37 6RP",
    "postcode": "CV37 6RP",
    "direction": "By Rail: On exiting the station turn left towards town centre. At first traffic lights turn left into Arden Street. At traffic lights at the far end turn right into Birmingham Road and over the small roundabout into Guild Street. Packwood House is located in Guild Street between John Street and Kwik Fit. Access to the building is via a green door with a sign stating 'test centre' on it.\n\nBy Bus: Alight in Bridge Street and walk along Union Street into Guild Street.\n\nBy Road: From North follow Birmingham Road into town over roundabout at Maybird Shopping Centre and over next roundabout into Guild Street. From South follow road over river bridge and bear right. At pedestrian controlled crossing bear left into Guild Street. We regret this Centre DOES NOT have candidate parking.\n\nFull Disabled Access - there is no step to enter the building and the lift is located through a door at the bottom of the staircase. Please call Pearson Customer services (0300 200 1122) for wheelchair access to be arranged.\n\nPlease note that the Test Centre is for candidates only and there are no waiting areas in the building for other visitors.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.7053817644151281,
        52.19381289029173
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096647Z"
  },
  {
    "title": "Worcester",
    "address": "3rd Floor Haswell House\nBlock B1\nSt. Nicholas Street\nWorcester\nWR1 1UN",
    "postcode": "WR1 1UN",
    "direction": "When leaving Foregate Street Railway Station, turn left and head towards the City centre. At the 2nd Junction opposite McDonalds, turn left down St Nicholas Street. Haswell House is opposite O’Neills bar, between Adecco Employment and Stepbystep Recruitment Agency. The entrance to Haswell House lies back from the shop frontages and there is a large sign in the window for Parkinson Wright Solicitors. Full disabled access; via the front doors to the building, which are level to the pavement. Once inside the building there is a lift on the Left hand side just past the staircase. The PPC is accessible directly opposite the lift on the 3rd floor. Please call Pearson Customer services (0300 200 1122) for wheelchair access to be arranged. Please note that there are no waiting facilities for people accompanying candidates to the Test Centre",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.2200187355821415,
        52.194044526689396
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096664Z"
  },
  {
    "title": "Leicester",
    "address": "Suite 3A Third Floor, Rutland Centre\n56 Halford Street\nLeicester\nLE1 1TQ",
    "postcode": "LE1 1TQ",
    "direction": "ON FOOT - from the clock tower go along Gallowtree Gate. Turn left into Halford Street, cross Charles Street and continue. The centre is on the left next to the NCP Car Park / Curve (Theatre) and opposite The Exchange café.\nBY CAR - follow the signs for Cultural Quarter/ Curve (Theatre) parking. The Pearson VUE test centre is next door to the car park entrance. Full Disabled Access is available; the entrance to the building is flat, has a wheelchair button for the doors and a lift to the third floor.\nPLEASE NOTE: We are unable to accommodate persons waiting for candidates in the Test Centre or the building.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.1281807932535761,
        52.63521640263902
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096680Z"
  },
  {
    "title": "Cheltenham",
    "address": "18 to 20 Albion Street\nCheltenham\nGL52 2LP",
    "postcode": "GL52 2LP",
    "direction": "Albion Street site is between Portland Street and Winchcombe Street on the corner of Albion Place. The PPC can be located immediately opposite the goods entrance to Marks and Spencer. This is the site of the old Coliseum Cinema.\n\nDisabled and Wheelchair access is available by using the side entrance to the PPC. Please call 0300 200 1188 for further information.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.072731995247337,
        51.90155433754977
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096702Z"
  },
  {
    "title": "Gloucester",
    "address": "Eastgate House\n121 - 131 Eastgate Street\nGloucester\nGL1 1PX",
    "postcode": "GL1 1PX",
    "direction": "Leaving Gloucester railway station, cross to the far side of Bruton Way and turn left. Walk down Bruton Way until you reach the traffic lights by the Leisure Centre (GL1). Turn right into Eastgate Street, and Eastgate House is approximately 100 yards on the right hand side.\n\nFull dsiabled access is available. Wheelchair users have fixed ramp outside and use of the lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.245159820239272,
        51.86390868431065
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096725Z"
  },
  {
    "title": "Corby",
    "address": "Corby Innovation Hub\nBangrave Road South\nCorby\nNN17 1NN",
    "postcode": "NN17 1NN",
    "direction": "\nFrom Corby Rail station, turn right onto Station Road (B6481). At the junction, turn left on Weldon Road (A427). Continue on Weldon Road to the second roundabout. Cross over this roundabout and exit onto the A43 signposted Kettering. The Test Centre is 100 metres on left. Bus service X4 stops just beyond the roundabout that crosses the A43.\nThere is ample free parking at the Test Centre which is situated within the Corby Innovation Hub, enter the building by the visitors entrance and report to reception. Full disabled access is available, wheelchair entry and exit to building from the car park is by dropped kerb, disabled parking spaces are also available. NB. The post code for the Hub does not work for Sat nav, please use 'Corby Test Centre' as the location",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.6512739048964021,
        52.49439373934483
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096742Z"
  },
  {
    "title": "Mansfield",
    "address": "Ground Floor, Nth Notts Business Centre\n32-34 Rosemary Street\nMansfield\nNG18 1QL",
    "postcode": "NG18 1QL",
    "direction": "The Centre is located close to the old Mansfield bus station. From this location go through the Rosemary Centre into the Rosemary Centre car park. (At the rear of the shopping area) The Test Centre is located between the car park and Rosemary Street, in the large red brick building - North Notts Business Centre - directly to the rear of Iceland. If you need wheelchair access please call 0300 200 1188 for further information. Wheelchair access is via a ramp at the Main entrance to the building which is assembled by staff by prior request. Please note that there are no waiting facilities for people accompanying candidates",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.4231747644178587,
        53.236947704581134
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096759Z"
  },
  {
    "title": "Grantham",
    "address": "1st Floor, The George Centre\nGuildhall Street\nGrantham\nNG31 6NJ",
    "postcode": "NG31 6NJ",
    "direction": "The George Shopping Centre is on the High Street opposite Lloyds Pharmacy with additional entrances on Westgate and Guildhall Street. Take the escalator to the first floor, and the test centre is on your right next to Travail Employment Group. Full disabled access; there are automatic doors for entry to the Shopping Centre and a lift is available to the first floor where the test centre is located and the Test Centre has it's own flat entrance. Please note that there are no waiting facilities in the Test Centre for people accompanying candidates.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.6431013111165452,
        52.91240967821792
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096775Z"
  },
  {
    "title": "Swindon",
    "address": "Ambrose House, Grd Flr, South Suite\n30-33 Milton Road\nSwindon\nSN1 5JA",
    "postcode": "SN1 5JA",
    "direction": "\nFrom the train station main exit, go down Wellington St. Turn right into Milford Street and past the blue office block. Cross Fleming Way into Fleet St. which becomes Faringdon Rd. Cross Farnsby St. and Milton Rd is first on left.\n\nFull diabled access is available, access is directly from the street",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.7898523322092375,
        51.56009686264335
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096791Z"
  },
  {
    "title": "Bangor",
    "address": "Suite 2\n30, Dean Street\nBangor\nLL57 1UR",
    "postcode": "LL57 1UR",
    "direction": "\nThe Centre is located half way down Dean Street, opposite the Dean Street Chip shop. The office is on the ground floor.\nDisabled access is via the main entrance, flat level access from the street. Please note, the office is for  candidates only and visitors cannot be accommodated",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.123849793253574,
        53.229252914238266
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096811Z"
  },
  {
    "title": "Hull",
    "address": "40 Bond Street\nHull\nHU1 3EN",
    "postcode": "HU1 3EN",
    "direction": "The centre is located at the junction of Bond St, George St, Saville St and Jameson St. The entrance to the centre is directly on Bond St behind the bus stop (Stand D).\n\n13/10/16 Candidates please be aware the area around our office is currently subject to building and development work. This does not directly impact our office / building however nearby roads are subject to closures and diversions so we would advise to allow additional travel time if you are not from the local area.\n\n13/9/17 We have recently been advise the whole of the Kingston House building will be undergoing refurbishment work for the next 18 months. Our office is not directly affected but occasional disruption may occur.\n\nFull disabled access",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.33922439510359764,
        53.745934514971694
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096836Z"
  },
  {
    "title": "Grimsby",
    "address": "Unit 8/9\nAcorn Business Park\nMoss Road\nGrimsby\nDN32 0LW",
    "postcode": "DN32 0LW",
    "direction": "The Test Centre is located on a business park at the rear of the town hall - from Town Hall Square, with the town hall on your left, take the first left down Doughty Rd. Go under the railway bridge and take next left down Moss Rd.\nPlease note - do not turn immediate left under the railway bridge as this is a council depot entrance only.\nThe Acorn business park is on the right, units 8/9 are on the right through the second set of green gates . There is no parking available on site - approx 5 min walk from bus station. PLEASE NOTE: There are no waiting facilities for non candidates at the Test Centre\n\nDisabled access via main door, flat and level from roadway - buzzer entry system",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.0821974757263703,
        53.563289256159514
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096860Z"
  },
  {
    "title": "Scunthorpe",
    "address": "Haldenby House (Unit 2A)\nDoncaster Road\nScunthorpe\nDN15 7DQ",
    "postcode": "DN15 7DQ",
    "direction": "From the M181 take the third exit at the terminal island onto Doncaster Rd passing Tesco and B&Q, after approx 0.5 mile Haldenby House is located on the right hand side.\n\nFrom the town centre head for the Berkeley Circle follow signs for the M180 on to Doncaster Rd, just after the Esso petrol station on the left hand side turn left into Haldenby House.\n\nThe centre is located in the left hand corner of the office units when viewed from the road.\n\nPLEASE NOTE public parking is extremely limited on site. Bus route 7 (Hourly) and route 1 (every 20 mins) have a stop at the Berkeley Circle.\n\nDisabled access via main office door, flat level access from footpath.\n",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.6856320490749892,
        53.58961266537775
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096886Z"
  },
  {
    "title": "Scarborough",
    "address": "29b St Nicholas Street\nScarborough\nYO11 2HF",
    "postcode": "YO11 2HF\n",
    "direction": "The test Centre is located on St Nichols St Opposite the Scarborough Council Customer First Centre.\n\nPlease note: If you need wheelchair access please call 0300 200 1188 for further information. Slight ramp to the main entrance door from footpath and internal chair left to the office",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.3990462644178587,
        54.28211614968596
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096910Z"
  },
  {
    "title": "Southampton",
    "address": "SECOND FLOOR SOUTH SUITE\nANGLO CITY HOUSE\n2-6 SHIRLEY ROAD\nSouthampton\nSO15 3EU",
    "postcode": "SO15 3EU",
    "direction": "By Train from Southampton Central Station Exit the station from the Platform 1 exit - the North Exit. Walk west on Blechynden Terrace and turn onto Southbrook Road, Right onto Millbrook Road East and then left onto Shirley Road. By Bus - all City centre buses stop outside of Anglo House. Upon arrival at the front entrance please press the intercom button labled Pearson VUE to access the building. The Test Centre is located on the Second Floor. This can be accessed via the stairs or lift. Wheelchair Access - Please call ahead to advise the team who will open the basement doors for ease of access.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.4166320799044763,
        50.90877796818918
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096935Z"
  },
  {
    "title": "Fareham",
    "address": "Ground Floor, Thackery House\n189-199 West Street\nFareham\nPO16 0EN",
    "postcode": "PO16 0EN",
    "direction": "THERE IS NO ON SITE PARKING AT THESE OFFICES BUT THERE ARE LOCAL CAR PARKS AVAILABLE\n\nBy TRAIN\nExit the railway station and turn left into West Street, Fareham\nThe test centre is approx. 400 metres along the road on the left.\nThackeray House (1st Floor) 189-199 West Street, Fareham PO16 0EN\n\nBy CAR\nFrom the M.27 (east or west bound), exit at Junction 11(Fareham)\nFollow the signs for Fareham/Gosport along the Eastern Way.\nStay in the left hand lane and go ‘over’ the single carriageway flyover onto ‘Western Way’\nFollow the dual carriageway to the end onto the round about; take the 3rd exit into West Street\nThe test centre is approx. 400 metres along the road on the left hand side.\n**To park your car, go past the test centre to the traffic light controlled junction (Trinity Street) and turn left into Trinity Street.\nThere is a public ‘Pay & Display’ car park approx. 150 metres up the hill on the right.\n\nFrom the A.27 (Titchfield/Park Gate)\nFollow the signs for Fareham Town centre, at the roundabout (Fire Station/Railway Station Entrance) take the 2nd exit into West Street, the test centre is approx 400 metres along on the left side.\nTo park your car follow ** as above.\n\nBy Public Transport\nExit at Fareham Bus Station, and turn left into West Street. Follow the main road for approx 300 metres, past the junction of Trinity Street and the test centre is on the right side of the road.\n\nFull disabled access is available. Wheelchair users have direct access",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.1856681375759068,
        50.85282573963864
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096960Z"
  },
  {
    "title": "Newport-Isle Wight",
    "address": "48 Lugley Street\nNewport (Isle of Wight)\nPO30 5HD",
    "postcode": "PO30 5HD",
    "direction": "From Newport Bus Station in South Street, turn right in to St.James Street (past McDonalds), walk through St.James Square and take 3rd right into Lugley St. No.48 is 50 yards along on the left.\n\nFull dsiabled access is available. Wheelchair users have access directly from the street",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.295872637432163,
        50.70077501604749
      ]
    },
    "createdAt": "2025-01-16T15:37:49.096985Z"
  },
  {
    "title": "Portsmouth",
    "address": "Ground Floor Annex - Enterprise House\nIsambard Brunel Road\nPortsmouth\nPO1 2AF",
    "postcode": "PO1 2AF",
    "direction": "From Portsmouth and Southsea railway station, turn left out of the station and follow the road round and the Test Centre will be on your left hand side. This is about a two minute walk. Bus numbers 1c, 15, 17, 18, 19, 23, 40, and the Hoverbus stop outside the site.\n\nFull disabled access is available, Wheelchair users have access straight from the street",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.0899845395535328,
        50.79782197502665
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097010Z"
  },
  {
    "title": "Salisbury",
    "address": "Suite 104, Ground Floor\nWarner House\n123 Castle Street\nSalisbury\nSP1 3TB",
    "postcode": "SP1 3TB",
    "direction": "Walking From Railway Station\n\nTurn left onto South Western Road and follow it onto Fisherton Street. Turn left onto Chapel Place and left again onto Summerlock Approach. Follow this past the short stay car Park keeping Sainsbury's to your right. Straight on to Avon Approach and turn right onto Castle Street. Warner House is on the left at the corner of Mill Stream Approach. Turn left into Mill Stream Approach, where you will find the entrance to the Test Centre through the gates on the right at the back of the building just before the stream. There is an intercom on the post next to the black gates, please press for access.\n\nBy Car\n\nEnter the Long Stay Central car Park via Mill Stream Approach. You will pass the PPC which is on the right, just before the stream.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.7963315325856843,
        51.07323259880808
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097034Z"
  },
  {
    "title": "Andover",
    "address": "Portland House First Floor\n55-57 High Street\nAndover\nAndover\nSP10 1LP",
    "postcode": "SP10 1LP",
    "direction": "From Andover railway station walk down station approach towards Junction Road. Continue on to Thre Crossways and on to Charlton Road. Follow Chalaton Road towards the Chantry Centre and the Guildhall. 57 High Street is on the right with silver double glazed doors between two shops. The PPC is on the first floor.\n\nA ramp is available from the street on demand and a chair lift is in operation as required.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.4792387951035975,
        51.20839561638237
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097063Z"
  },
  {
    "title": "Bournemouth",
    "address": "Roddis House, 3rd Floor\nOld Christchurch Rd\nBournemouth\nBH1 1LG\n",
    "postcode": "BH1 1LG",
    "direction": "From bus stops at The Square take Old Christchurch Road past Post Office Road on the left and just before you get to McDonalds, the main entrance to Roddis House is on the opposite side of the road. Press entry button marked Test Centre. We are on the 3rd floor.\n\nFull disabled access is available via a lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.8781627932535756,
        50.720188860937355
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097089Z"
  },
  {
    "title": "Chichester",
    "address": "Metro House\nNorthgate\nChichester\nPO19 1BE",
    "postcode": "PO19 1BE",
    "direction": "Leave the train station and head towards Stockbridge Road, turn a slight left onto Southgate and then onto South Street and continue walking straigh up South Street, past the Cross and continue onto North street. Metro House is at the top of North street where it meets Northgate and will be straight ahead. The closest parking is Chichester Festival Theatre Car Park. We have our own entrance to the testing suite, please follow the signs and don't use the main entrance. Please note Wheelchair users should access through the main reception\nNB. PLEASE DO NOT OBSTRUCT THE FIRE STATION ENTRANCE NEXT DOOR WITH VEHICLES OR THEY WILL BE TOWED BY THE POLICE.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -0.7787774067464239,
        50.840593000869056
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097114Z"
  },
  {
    "title": "Frome",
    "address": "\n2 Baywell House (under archway)\nTucker Close\nFrome\nBA11 5LS",
    "postcode": "BA11 5LS",
    "direction": "Exit Frome Station and turn right onto Station Approach. Continue to the main road and turn Right onto the A362 Wallbridge Road. Continue for approximately 500m, go under the railway bridge and take the first tuning left into Tuckers Close.\n\nFrom the A362 turn onto the Warminster Road towards ASDA superstore, 2nd exit of the roundabout, straight across at the traffic lights, then the first turning right into Tuckers Close.\n\nBaywell House is just in from the junction of Tuckers Close on the left, the building is signposted, you will need to walk under the archway and our entrance is towards the end of the building on the right.\n\nPlease note: there is no parking available for candidates, cars should be parked in local car parks or candidates dropped off.\n\nFull disabled access is available. Wheelchair users can access by a ramp which will be put in place as required",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.3089341613574508,
        51.22904137953525
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097140Z"
  },
  {
    "title": "Weymouth",
    "address": "Phoenix House\nSt. Nicholas Street\nWeymouth\nDT4 8AA",
    "postcode": "DT4 8AA",
    "direction": "IF WALKING: Cross the Town Bridge to the East side and turn left just before the Crown Hotel into Lower St. Edmonds Street. After 100yds turn right into St. Nicholas Street. Pheonix House is opposite the Lakeside Superbowl. FROM ALL OTHER ROUTES; follow the Brown Tourist signs to Lakeside Bowling.\n\nFull dsiabled access is available. Wheelchair users have direct access from the street",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.455731306746424,
        50.60831858324778
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097165Z"
  },
  {
    "title": "Yeovil",
    "address": "\nThe Coach House, Grd Floor\nSt Nicholas Close, Penn Hill\nYeovil\nBA20 1SF",
    "postcode": "BA20 1SF",
    "direction": "ON FOOT: From town centre proceed along King George Street past the Post Office & turn left at the library onto South Street. Take the first right onto Penn Hill then first right onto St Nicholas Close.\nBY CAR: At Horsey roundabout take the Town centre exit onto Brunswick Street, straight across at the traffic lights and pass the Goldenstones Leisure Centre on your right. Take the first left onto Penn Hill then second left onto St. Nicholas Close.\nThe Pearson test centre is just up the hill from the turning onto St Nicholas Close on the right with a gravel car park at the front of the building.\n\nLimited disabled access , wheelchair access direct from car park via a portable ramp. Please note the car park is loose stone chip which may cause some users difficulty. Should this be the case Frome is a local alternative centre or please call the contact centre for support.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.631365274968862,
        50.93981588277195
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097190Z"
  },
  {
    "title": "Taunton",
    "address": "\nGround Floor, Victoria House,\nVictoria Street\nTaunton\nTA1 3FA",
    "postcode": "TA1 3FA",
    "direction": "Catch any bus from the Bus Station which goes past East Reach and get off at the stop just past the Petrol Garage/Tesco Express. Cross the road and walk to the corner then turn right into Victoria Street. Go to the top of the hill and we are in Victoria House on the Ground Floor. (The large building on the left.)\n\nFull dsiabled access is available. Wheelchair users have access from the car park at the back into the main building",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.090473835582141,
        51.015299744165844
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097217Z"
  },
  {
    "title": "Bristol",
    "address": "\nBuilding 340\nThe Crescent\nBristol Business Park\nBristol\nBS16 1EJ",
    "postcode": "BS16 1EJ",
    "direction": "By Bus\n\n\nFrom the Coldharbour Lane bus stop walk south approximately 150m towards the Traffic Light Crossing. At these lights turn left into the Bristol Business Park which is through staggered gates. Follow the path onto the Avenue and follow this nearly to the end, then turn right onto the pathway in front of the building which will take you to The Gardens. Immediately opposite is the The Crescent, 340 is the 4th building on the Righthand side.\n\nPlease note the site has parking for 20 cars- Please do not park in neighbouring Car Parks",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -2.5400214355821413,
        51.5026567050232
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097242Z"
  },
  {
    "title": "Barnstaple",
    "address": "Riverside Court Offices - Unit 1 and 4\nCastle Street\nBarnstaple\nEX31 1DR",
    "postcode": "EX31 1DR",
    "direction": "Locate Marks and Spencers in the High Street. Go to the rear entrance and you will come to the (Old Cattle Market) car park. With this on your right, walk to the Painted Fan restaurant (50 metres). Diagonally across the road is the Test Centre..\n\nFull Disabled Access is available; wheelchair access via a ramp.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -4.062966703747073,
        51.0802951958093
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097266Z"
  },
  {
    "title": "Exeter",
    "address": "\nGround Floor\nUnit 11, The Depot\nBelgrave Road\nExeter\nEX1 2FT",
    "postcode": "EX1 2FT",
    "direction": "By Train:\nFrom Exeter Central station, exit left onto Queen Street and follow the road for 300m and then turn left onto High Street. Follow High street  for 300m and cross onto Sidwell Street then at the end turn right onto Summerland Street. The PPC is on the Corner of Belgrave Road.\n\n By Bus:\nAlight at the Bus Station onto Cheeke Street and follow it right until Belgrave Road on the left, and the office will be found where it meets Summerland Street,\n\n By Car:\nThere is an NCP Car Park on Belgrave Road",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.522132962839185,
        50.72688626953491
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097291Z"
  },
  {
    "title": "Torquay",
    "address": "\nCastle Circus House, Rooms 36 - 38\n136 Union Street\nTorquay\nTQ2 5QB",
    "postcode": "TQ2 5QB",
    "direction": "From Castle Circus (Town Hall) walk down Union Street, the main shopping street, for about 40 metres. Castle Circus House is situated on the right hand side next to Irvine Nott Estate Agents. The test centre is at the rear of the first floor and is well signposted inside the building.\nIf travelling by train there is a frequent bus service to Castle Circus from either Torre or Torquay stations.\n\nFull dsiabled access is available. Wheelchair users have street access and use of the lift.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -3.5318639067464237,
        50.46813557983384
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097317Z"
  },
  {
    "title": "Morpeth",
    "address": "Unit 7\nTelford Court\nLoansdean\nMorpeth\nNE61 2DB",
    "postcode": "NE61 2DB",
    "direction": "From town centre follow main road south over Telford Bridge towards the railway station. At the first roundabout continue to follow B1337 south towards Newcastle for approx 1 mile. Telford court is on the left hand side adjacent to a roundabout which serves as entrance to Northumberland County Hall.\nPlease allow 25 mins for this journey on foot from the town centre.\n\nALL CANDIDATES PLEASE BE AWARE THERE IS NO PUBLIC PARKING / WAITING AT THIS TEST CENTRE - Candidates are asked to make arrangements to be dropped off / collected at the estate entrance.\n\nThe nearest parking available is at the county offices overflow car park, which is clearly signposted from the B1337 and a few minutes walk from the test centre.\n\nPlease note: If you need wheelchair access please call 0300 200 1188 for further information.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.6894137906499913,
        55.15481219771954
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097343Z"
  },
  {
    "title": "Newcastle",
    "address": "First Floor\nCollingwood House\n3 Collingwood Street\nNewcastle Upon Tyne\nNE1 1JW",
    "postcode": "NE1 1JW",
    "direction": "The Test Centre is located at the junction of Collingwood St and St Nicholas st (Opposite St Nicholas Cathedral). There are no public car parks adjacent to the centre however most bus routes have stops close by plus the metro and central rail station are 2 minutes walk away.\n\nFull Disabled Access: Street level entrance into the ground floor then internal lift to the first floor for testing.",
    "geoLocation": {
      "type": "Point",
      "coordinates": [
        -1.6123483375759031,
        54.97011418482512
      ]
    },
    "createdAt": "2025-01-16T15:37:49.097369Z"
  }
]